export const bengaliMap = {
    "অ": "a", "আ": "aa", "ই": "i", "ঈ": "ee",
    "উ": "u", "ঊ": "oo", "ঋ": "ri", "এ": "e",
    "ঐ": "oi", "ও": "o", "ঔ": "ou",

    "ক": "k", "খ": "kh", "গ": "g", "ঘ": "gh",
    "ঙ": "ng", "চ": "ch", "ছ": "chh", "জ": "j",
    "ঝ": "jh", "ঞ": "ny", "ট": "t", "ঠ": "th",
    "ড": "d", "ঢ": "dh", "ণ": "n", "ত": "t",
    "থ": "th", "দ": "d", "ধ": "dh", "ন": "n",
    "প": "p", "ফ": "ph", "ব": "b", "ভ": "bh",
    "ম": "m", "য": "j", "র": "r", "ল": "l",
    "শ": "sh", "ষ": "sh", "স": "s", "হ": "h",
    "ৎ": "t",

    "ড়": "r", "ঢ়": "rh", "য়": "y",

    "া": "aa", "ি": "i", "ী": "ee", "ু": "u",
    "ূ": "oo", "ৃ": "ri", "ে": "e", "ৈ": "oi",
    "ো": "o", "ৌ": "ou",

    "ং": "ng", "ঃ": "h", "ঁ": "n", "়": "",
};

export const BENGALI_VIRAMA = "্";
