export const gujaratiMap = {
    "અ": "a", "આ": "aa", "ઇ": "i", "ઈ": "ee",
    "ઉ": "u", "ઊ": "oo", "એ": "e", "ઐ": "ai",
    "ઓ": "o", "ઔ": "au",
    "ક": "k", "ખ": "kh", "ગ": "g", "ઘ": "gh",
    "ચ": "ch", "છ": "chh", "જ": "j", "ઝ": "jh",
    "ટ": "t", "ઠ": "th", "ડ": "d", "ઢ": "dh",
    "ણ": "n", "ત": "t", "થ": "th", "દ": "d",
    "ધ": "dh", "ન": "n", "પ": "p", "ફ": "ph",
    "બ": "b", "ભ": "bh", "મ": "m", "ય": "y",
    "ર": "r", "લ": "l", "વ": "v", "શ": "sh",
    "ષ": "sh", "સ": "s", "હ": "h",

    "ા": "aa", "િ": "i", "ી": "ee", "ુ": "u",
    "ૂ": "oo", "ે": "e", "ૈ": "ai", "ો": "o",
    "ૌ": "au",

    "ં": "n", "ઃ": "h",
};

export const GUJARATI_VIRAMA = "્";
