export const gurmukhiMap = {
    "ਅ": "a", "ਆ": "aa", "ਇ": "i", "ਈ": "ee",
    "ਉ": "u", "ਊ": "oo", "ਏ": "e", "ਐ": "ai",
    "ਓ": "o", "ਔ": "au",
    "ਕ": "k", "ਖ": "kh", "ਗ": "g", "ਘ": "gh",
    "ਙ": "ng", "ਚ": "ch", "ਛ": "chh", "ਜ": "j",
    "ਝ": "jh", "ਞ": "ny", "ਟ": "t", "ਠ": "th",
    "ਡ": "d", "ਢ": "dh", "ਣ": "n", "ਤ": "t",
    "ਥ": "th", "ਦ": "d", "ਧ": "dh", "ਨ": "n",
    "ਪ": "p", "ਫ": "ph", "ਬ": "b", "ਭ": "bh",
    "ਮ": "m", "ਯ": "y", "ਰ": "r", "ਲ": "l",
    "ਵ": "v", "ਸ": "s", "ਹ": "h",

    "ਸ਼": "sh",

    "ਾ": "aa", "ਿ": "i", "ੀ": "ee", "ੁ": "u",
    "ੂ": "oo", "ੇ": "e", "ੈ": "ai", "ੋ": "o",
    "ੌ": "au",

    "ੰ": "n", "ਃ": "h", "ਂ": "n", "਼": "",

    "ਖ਼": "kh", "ਗ਼": "g", "ਜ਼": "z", "ਫ਼": "f", "ਲ਼": "l", "ੜ": "r",
};

export const GURMUKHI_VIRAMA = "੍";
export const GURMUKHI_ADDAK = "ੱ";
