export const kannadaMap = {
    "ಅ": "a", "ಆ": "aa", "ಇ": "i", "ಈ": "ee",
    "ಉ": "u", "ಊ": "oo", "ಎ": "e", "ಏ": "ae",
    "ಐ": "ai", "ಒ": "o", "ಓ": "oo", "ಔ": "au",
    "ಕ": "k", "ಖ": "kh", "ಗ": "g", "ಘ": "gh",
    "ಚ": "ch", "ಛ": "chh", "ಜ": "j", "ಝ": "jh",
    "ಟ": "t", "ಠ": "th", "ಡ": "d", "ಢ": "dh",
    "ಣ": "n", "ತ": "t", "ಥ": "th", "ದ": "d",
    "ಧ": "dh", "ನ": "n", "ಪ": "p", "ಫ": "ph",
    "ಬ": "b", "ಭ": "bh", "ಮ": "m", "ಯ": "y",
    "ರ": "r", "ಲ": "l", "ವ": "v", "ಶ": "sh",
    "ಷ": "sh", "ಸ": "s", "ಹ": "h",

    "ಾ": "aa", "ಿ": "i", "ೀ": "ee", "ು": "u",
    "ೂ": "oo", "ೆ": "e", "ೇ": "ae", "ೈ": "ai",
    "ೊ": "o", "ೋ": "oo", "ೌ": "au",

    "ಂ": "m", "ಃ": "h",
};

export const KANNADA_VIRAMA = "್";
