export const malayalamMap = {
    "അ": "a", "ആ": "aa", "ഇ": "i", "ഈ": "ee",
    "ഉ": "u", "ഊ": "oo", "എ": "e", "ഏ": "ae",
    "ഐ": "ai", "ഒ": "o", "ഓ": "oo", "ഔ": "au",
    "ക": "k", "ഖ": "kh", "ഗ": "g", "ഘ": "gh",
    "ങ": "ng", "ച": "ch", "ഛ": "chh", "ജ": "j",
    "ഝ": "jh", "ഞ": "ny", "ട": "t", "ഠ": "th",
    "ഡ": "d", "ഢ": "dh", "ണ": "n", "ത": "t",
    "ഥ": "th", "ദ": "d", "ധ": "dh", "ന": "n",
    "പ": "p", "ഫ": "ph", "ബ": "b", "ഭ": "bh",
    "മ": "m", "യ": "y", "ര": "r", "ല": "l",
    "വ": "v", "ശ": "sh", "ഷ": "sh", "സ": "s",
    "ഹ": "h", "ള": "l", "ഴ": "zh", "റ": "r",

    "ാ": "aa", "ി": "i", "ീ": "ee", "ു": "u",
    "ൂ": "oo", "െ": "e", "േ": "ae", "ൈ": "ai",
    "ൊ": "o", "ോ": "oo", "ൌ": "au",

    "ം": "m", "ഃ": "h",
};

export const MALAYALAM_VIRAMA = "്";
