export const odiaMap = {
    "ଅ": "a", "ଆ": "aa", "ଇ": "i", "ଈ": "ee",
    "ଉ": "u", "ଊ": "oo", "ଏ": "e", "ଐ": "ai",
    "ଓ": "o", "ଔ": "au",
    "କ": "k", "ଖ": "kh", "ଗ": "g", "ଘ": "gh",
    "ଙ": "ng", "ଚ": "ch", "ଛ": "chh", "ଜ": "j",
    "ଝ": "jh", "ଟ": "t", "ଠ": "th", "ଡ": "d",
    "ଢ": "dh", "ଣ": "n", "ତ": "t", "ଥ": "th",
    "ଦ": "d", "ଧ": "dh", "ନ": "n", "ପ": "p",
    "ଫ": "ph", "ବ": "b", "ଭ": "bh", "ମ": "m",
    "ଯ": "y", "ର": "r", "ଲ": "l", "ଵ": "v",
    "ଶ": "sh", "ଷ": "sh", "ସ": "s", "ହ": "h",

    "ା": "aa", "ି": "i", "ୀ": "ee", "ୁ": "u",
    "ୂ": "oo", "େ": "e", "ୈ": "ai", "ୋ": "o",
    "ୌ": "au",

    "ଂ": "n", "ଃ": "h",
};

export const ODIA_VIRAMA = "୍";
