export const tamilMap = {
    "அ": "a", "ஆ": "aa", "இ": "i", "ஈ": "ee",
    "உ": "u", "ஊ": "oo", "எ": "e", "ஏ": "ae",
    "ஐ": "ai", "ஒ": "o", "ஓ": "o", "ஔ": "au",

    "க": "k", "ங": "ng", "ச": "s", "ஞ": "ny",
    "ட": "d", "ண": "n", "த": "th", "ந": "n",
    "ப": "p", "ம": "m", "ய": "y", "ர": "r",
    "ல": "l", "வ": "v", "ழ": "zh", "ள": "l",
    "ற": "r", "ன": "n", "ஜ": "j", "ஷ": "sh",
    "ஸ": "s", "ஹ": "h",
    "ச்ச": "ch", "ட்ட": "tt", "ஞ்ச": "nj", "ம்ப": "mb", "ங்க": "ng",

    "ா": "aa", "ி": "i", "ீ": "ee", "ு": "u",
    "ூ": "oo", "ெ": "e", "ே": "ae", "ை": "ai",
    "ொ": "o", "ோ": "o", "ௌ": "au",
};

export const TAMIL_VIRAMA = "்";

export const TAMIL_PHONETIC_DICT = {
    "இல்லை": "illai", "என்ன": "enna", "நான்": "naan", "நீ": "nee",
    "எனக்கு": "enakku", "உனக்கு": "unakku", "காதல்": "kaadhal", "நீயே": "neeyae",
};
