export const teluguMap = {
    "అ": "a", "ఆ": "aa", "ఇ": "i", "ఈ": "ee",
    "ఉ": "u", "ఊ": "oo", "ఎ": "e", "ఏ": "ae",
    "ఐ": "ai", "ఒ": "o", "ఓ": "oo", "ఔ": "au",
    "క": "k", "ఖ": "kh", "గ": "g", "ఘ": "gh",
    "చ": "ch", "ఛ": "chh", "జ": "j", "ఝ": "jh",
    "ట": "t", "ఠ": "th", "డ": "d", "ఢ": "dh",
    "ణ": "n", "త": "t", "థ": "th", "ద": "d",
    "ధ": "dh", "న": "n", "ప": "p", "ఫ": "ph",
    "బ": "b", "భ": "bh", "మ": "m", "య": "y",
    "ర": "r", "ల": "l", "వ": "v", "శ": "sh",
    "ష": "sh", "స": "s", "హ": "h",

    "ా": "aa", "ి": "i", "ీ": "ee", "ు": "u",
    "ూ": "oo", "ె": "e", "ే": "ae", "ై": "ai",
    "ొ": "o", "ో": "oo", "ౌ": "au",

    "ం": "m", "ః": "h",
};

export const TELUGU_VIRAMA = "్";

export const TELUGU_PHONETIC_DICT = {
    "హే": "hae", "నీ": "nee", "అయ్య": "ayya", "చెయ్య": "cheyya", "జెయ్య": "jeyya",
    "జంబలికే": "jambalike", "జంబాలికే": "jambaalike",
};
