export const urduMap = {
    "ا": "a", "ب": "b", "پ": "p", "ت": "t",
    "ٹ": "t", "ث": "s", "ج": "j", "چ": "ch",
    "ح": "h", "خ": "kh", "د": "d", "ڈ": "d",
    "ذ": "z", "ر": "r", "ڑ": "r", "ز": "z",
    "ژ": "zh", "س": "s", "ش": "sh", "ص": "s",
    "ض": "z", "ط": "t", "ظ": "z", "ع": "a",
    "غ": "gh", "ف": "f", "ق": "q", "ک": "k",
    "گ": "g", "ل": "l", "م": "m", "ن": "n",
    "ں": "n", "و": "w", "ہ": "h", "ھ": "h",
    "ی": "y", "ے": "e",

    "ك": "k", "ي": "y", "ه": "h", "آ": "aa",
    "ئ": "y", "ة": "t", "أ": "a", "إ": "i",
    "ؤ": "u", "ء": "'", "ٱ": "a", "ٰ": "a", "ى": "a",

    "َ": "a", "ِ": "i", "ُ": "u",
    "ً": "an", "ٍ": "in", "ٌ": "un",
};

export const URDU_SUKUN = "ْ";
export const URDU_SHADDA = "ّ";

export const URDU_PHONETIC_DICT = {
    "کن": "kun", "کُن": "kun", "فیکون": "fayakoon", "فَیکون": "fayakoon", "فَيَكُون": "fayakoon", "فيكن": "fayakun",
    "صلی": "Salla", "صلّی": "Salla", "صلّى": "Salla", "علیہ": "Alayhi", "وسلم": "Wasallam", "صدق": "Sadaqa",
    "العلی": "Al-Ali", "العظیم": "Al-Azeem", "رسولہ": "Rasooluhu", "النبی": "An-Nabi", "الکریم": "Al-Kareem",
    "رسول": "Rasool", "نبی": "Nabi", "کریم": "Kareem", "عظیم": "Azeem", "علی": "Ali", "حق": "Haq", "یا": "Ya",
    "کالیاں": "kaliyan", "باریاں": "bariyan", "گڈیاں": "gadiyan", "نوں": "nu", "لاواں": "lawan", "سپیڈ": "speed",
    "چلاں": "chalan", "پلس": "police", "سامنے": "samne", "سامٹے": "samne", "نئیں": "nai", "رکدا": "rukda",
    "رُکدا": "rukda", "بریکاں": "breakan", "ٹیٹر": "tyre", "دی": "di", "دے": "de", "چیخ": "cheekh",
    "کڈھدا": "kadhda", "سارے": "sare", "لوکی": "loki", "تکدے": "takde", "کیہہ": "ki", "گیا": "gaya",
    "لگدا": "lagda", "انج": "anj", "رک": "ruk", "دو": "do", "سو": "so", "وی": "wi",
    "اللہ": "Allah", "ہے": "hai", "ہیں": "hain", "میں": "mein", "تھا": "tha", "تھی": "thi", "تھے": "the",
    "کی": "ki", "کے": "ke", "کا": "ka", "کو": "ko", "کر": "kar", "پر": "par", "سے": "se", "تم": "tum",
    "ہم": "hum", "وہ": "woh", "یہ": "yeh", "اور": "aur", "نہیں": "nahin", "نہ": "na", "تو": "to", "جو": "jo",
    "کوئی": "koi", "میرا": "mera", "میری": "meri", "میرے": "mere", "تیرا": "tera", "تیری": "teri", "تیرے": "tere",
    "ہو": "ho", "ہونا": "hona", "ہوا": "hua", "ہوئے": "hue", "ہوئی": "hui", "پیار": "pyar", "محبت": "mohabbat",
    "عشق": "ishq", "زندگی": "zindagi", "دل": "dil", "صنم": "sanam", "یار": "yaar", "دوست": "dost",
    "تمہارا": "tumhara", "تمہاری": "tumhari", "تمہارے": "tumhare", "ہمارا": "hamara", "ہماری": "hamari",
    "ہمارے": "hamare", "اپنا": "apna", "اپنی": "apni", "اپنے": "apne", "ایک": "ek", "تین": "teen",
};
